# ============================================================================
#  Brewfile - Homebrew Bundle
#  Install: brew bundle --file=Brewfile
# ============================================================================

# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# ============================================================================
#  Shell & Prompt
# ============================================================================
brew "zsh"
brew "starship"

# ============================================================================
#  Modern CLI Replacements
# ============================================================================
brew "eza"          # Better ls
brew "bat"          # Better cat
brew "fd"           # Better find
brew "ripgrep"      # Better grep
brew "fzf"          # Fuzzy finder
brew "zoxide"       # Smart cd
brew "tree"         # Directory tree
brew "jq"           # JSON processor

# ============================================================================
#  Editor & Terminal Multiplexer
# ============================================================================
brew "neovim"
brew "tmux"

# ============================================================================
#  Git & Version Control
# ============================================================================
brew "git"
brew "lazygit"
brew "gh"           # GitHub CLI

# ============================================================================
#  Container & Kubernetes
# ============================================================================
brew "lazydocker"
brew "kubernetes-cli"
brew "k9s"
brew "helm"
brew "kubectx"

# ============================================================================
#  Node.js & JavaScript
# ============================================================================
brew "nvm"
brew "bun"

# ============================================================================
#  File Management
# ============================================================================
brew "yazi"         # Terminal file manager
brew "stow"         # Symlink manager

# ============================================================================
#  System & Utilities
# ============================================================================
brew "neofetch"
brew "btop"
brew "thefuck"
brew "sesh"         # Tmux session manager
brew "pass"         # Password manager

# ============================================================================
#  Media & Misc
# ============================================================================
brew "imagemagick"
brew "ffmpeg"

# ============================================================================
#  Cask Applications
# ============================================================================
cask "kitty"
cask "ghostty"
cask "font-meslo-lg-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"

